SOPs/rnaseq.org
#+STARTUP: indent
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+TITLE:     RNASeq
#+AUTHOR:    John Brestelli
#+DESCRIPTION: RNASeq Data Type
#+OPTIONS: num:nil
#+HTML_HEAD: <style> #content{max-width:1800px;}</style>
#+HTML_HEAD: <style> p{max-width:800px;}</style>
#+HTML_HEAD: <style> li{max-width:800px;}</style
* RNASeq
** Data Acquisition
*** fastq files (NOT Needed if from EBI)
**** SRA
***** Method 1
1. cd to workSpace directory
2. run "getSampleInfoFromSRA.pl ERPXXXXX" which creates a text file ERPXXXXX.samples.txt
3. modify sample names in ERPXXXXX.samples.txt
4. run "createRNASeqDatasetFromTabFile.pl --sample_file ERPXXXXX.samples.txt  --profileset_name "ADD PROFILE SET NAME HERE --is_strand_specific true/false

***** Method 2
1. testSRAFetch.pl --getFastq  SRX590168
2. all files are named the same so need to rename or you will lose their identity (paired end will produce 2 files - readsFor2.fastq)
   - mv readsFor1.fastq mrna.fastq
3. testSRAFetch.pl does not work for paired-end anymore. A new script is checked into SVN for both single-end and paired-end:
   - SingleSRADump.pl --sampleId SRX2751960 --isPairedEnd
4. The download files are named after sampleId (SRX2751960, SRX2751960.paired)



**** Colorspace SOLiD data
1. use fastq-dump -B to download fastq data with ATCG instead of number in the 2nd lines. e.g. fastq-dump -B -A ERR32754 -B | --dump base Formats sequence using base space (default for other than SOLiD)
2. For colorspace SOLiD data, we can directly use "rnaSeqSample_QuerySRA" dataset class. CBIL/Util/lib/perl/Sra.pm will extract colorspace file to fastq data with ATCG. e.g. [[https://cbilsvn.pmacs.upenn.edu/svn/apidb/ApiCommonDatasets/trunk/Datasets/lib/xml/datasets/FungiDB/anidFGSCA4/Sibthorp_Growth_Conditions.xml][Sibthorp_Growth_Conditions]]

**** BAM files from Provider
1. convert BAM to FASTQ. Probably not the best but it is  doable. e.g. bam2fastq -o s1_48.sorted# s1_48.sorted.bam
   - /eupath/data/EuPathDB/manualDelivery/CryptoDB/cparIowaII/rnaSeq/Lippuner/2012-08-24/workSpace/README
2. You can first sort the bam by read id - if there are read pairs, they will be sorted and paired up. However, this can be a problem if there are pairs where one has no read.
   - samtools sort -n map.Toxo1.sorted.bam > sortedToxo1.bam &
3. An alternative bam to fastq script, a bedtools can be used:
   - bamToFastq -i sortedToxo1.bam -fq sortedToxo1.fastq  -fq2 sortedToxo1Pair.fastq) >& sortedToxo1.err &
** Dataset Configuration 
*** Manual Delivery
**** analysisConfig.txt file
- when there are multiple profile set names for one dataset, each profileSet should have a prefix followed by a space, a dash and a space then something that distinguishes them.
  - Example: yew:/eupath/data/EuPathDB/manualDelivery/PlasmoDB/pberANKA/rnaSeq/Waters_Stunnenberg_five_stages/2014-03-14/final/analysisConfig.xml
- if there are replicates, the replicate sample names should be identical while of course the file names are not
- commas are not tolerated in the sample names and will cause a problem on the website
- If one experiment designed for multiple organisms, in the analysisConfig.xml file, for profileSetName, it can use the same value but separate it with a organism abbreviation.
  - Example(s): yew:/eupath/data/EuPathDB/manualDelivery/AmoebaDB/acasNeff/rnaSeq/Trophozoite_transcriptome/2017-12-29/final/analysisConfig.xml
                yew:/eupath/data/EuPathDB/manualDelivery/AmoebaDB/ehisHM1IMSS/rnaSeq/Trophozoite_transcriptome/2017-11-21/final/analysisConfig.xml
- the names can have "+" or "-" but not slashes ("/")
  - In terms of profileSetName: a note from Kathryn "The problem is that when you have commas in profile set names they work ok on component sites, but it breaks the portal because commas are also used as delimiters there.  We had several problems where datasets were QA'd in the components and signed off, but didn't work in the portal. To prevent this, we made the workflow throw and error when it finds a profileset name with a comma. You can safely change these in the analysisConfig - these are only used internally. A displayName, which can have commas, can be added in the presenter."
- If the sample names are changed in the analysisConfig.xml file after an initial run, in most cases all that is required is that the doTranscriptExpression needs to be undone in the workflow and rerun. However, if the samples have replicates, the step normalizeBedGraph also needs to be undone and rerun. This step will do nothing when undone but as it reruns, it will remove the original analyze_XXXXXXXXX_combined/  directories and then remake them with the correct names. This is true even if the replicate relationships are changed. If normalizeBedGraph is not undone, the old combined dirs will remain and the step copyNormalizedBedGraphFiles will fail because it will not find the dirs it needs.




**** fastq files (optional)
- Place into manual delivery fastq files as described by the rnaSeqExperiment dataset class in [[https://github.com/VEuPathDB/EbrcModelCommon/blob/master/Model/lib/xml/datasetClass/classes.xml][classes.xml]]
- NOTE:  file names with #1 and #2 are not a reliable indication of strandedness when isStrandSpecific=true and hasPairedEnds=true
  - sense = forward should not be the .paired file but antisense = reverse should be .paired
- not needed for RNASeq from EBI
*** Dataset XML
**** NOTES
- adaptor library maintenance
  - There is a data folder under DJob/DistribJobTask/data with the currently available Illumina adaptors for both PE and SE chemistry.
    - if the datasets are from experiments where sequencing chemistry other than TruSeq2 (as used in GAII machines) and TruSeq3 (as used by HiSeq and MiSeq machines) we would need to give a custom fasta file of adaptors or add to ours. ***

** Presenter Configuration
