SOPs/rnaseq.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 18 May. 2022 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RNASeq</title>
<meta name="author" content="John Brestelli" />
<meta name="description" content="RNASeq Data Type" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<style> li{max-width:800px;}</style
</head>
<body>
<main id="content" class="content">
<header>
<h1 class="title">RNASeq</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge78b515">RNASeq</a>
<ul>
<li><a href="#orgd0c2a77">Data Acquisition</a>
<ul>
<li><a href="#org51ea65c">fastq files (NOT Needed if from EBI)</a></li>
</ul>
</li>
<li><a href="#org1750285">Dataset Configuration</a>
<ul>
<li><a href="#org4b09224">Manual Delivery</a></li>
<li><a href="#org371c2b4">Dataset XML</a></li>
</ul>
</li>
<li><a href="#orgd583a9e">Presenter Configuration</a>
<ul>
<li><a href="#orgfbfafd2">Injector</a></li>
<li><a href="#org778810b">Special Considerations for the Dataset Presenter XML</a></li>
</ul>
</li>
<li><a href="#orgac2be03">QA</a>
<ul>
<li><a href="#orgacc2e4f">Automated QA</a></li>
<li><a href="#orgd43b87b">Manual QA</a></li>
</ul>
</li>
<li><a href="#orgaee9f84">Patches</a>
<ul>
<li><a href="#orgd925e41">Strand Specific Error</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
<section id="outline-container-orge78b515" class="outline-2">
<h2 id="orge78b515">RNASeq</h2>
<div class="outline-text-2" id="text-orge78b515">
</div>
<div id="outline-container-orgd0c2a77" class="outline-3">
<h3 id="orgd0c2a77">Data Acquisition</h3>
<div class="outline-text-3" id="text-orgd0c2a77">
</div>
<div id="outline-container-org51ea65c" class="outline-4">
<h4 id="org51ea65c">fastq files (NOT Needed if from EBI)</h4>
<div class="outline-text-4" id="text-org51ea65c">
</div>
<ul class="org-ul">
<li><a id="orga5ad4cf"></a>SRA<br>
<ul class="org-ul">
<li><a id="org9924a62"></a>Method 1<br>
<div class="outline-text-6" id="text-org9924a62">
<ol class="org-ol">
<li>cd to workSpace directory</li>
<li>run &ldquo;getSampleInfoFromSRA.pl ERPXXXXX&rdquo; which creates a text file ERPXXXXX.samples.txt</li>
<li>modify sample names in ERPXXXXX.samples.txt</li>
<li>run &ldquo;createRNASeqDatasetFromTabFile.pl &#x2013;sample_file ERPXXXXX.samples.txt  &#x2013;profileset_name &rdquo;ADD PROFILE SET NAME HERE &#x2013;is_strand_specific true/false</li>
</ol>
</div>
</li>

<li><a id="org2321357"></a>Method 2<br>
<div class="outline-text-6" id="text-org2321357">
<ol class="org-ol">
<li>testSRAFetch.pl &#x2013;getFastq  SRX590168</li>
<li>all files are named the same so need to rename or you will lose their identity (paired end will produce 2 files - readsFor2.fastq)
<ul class="org-ul">
<li>mv readsFor1.fastq mrna.fastq</li>
</ul></li>
<li>testSRAFetch.pl does not work for paired-end anymore. A new script is checked into SVN for both single-end and paired-end:
<ul class="org-ul">
<li>SingleSRADump.pl &#x2013;sampleId SRX2751960 &#x2013;isPairedEnd</li>
</ul></li>
<li>The download files are named after sampleId (SRX2751960, SRX2751960.paired)</li>
</ol>
</div>
</li>
</ul>
</li>



<li><a id="orgae9a9f6"></a>Colorspace SOLiD data<br>
<div class="outline-text-5" id="text-orgae9a9f6">
<ol class="org-ol">
<li>use fastq-dump -B to download fastq data with ATCG instead of number in the 2nd lines. e.g. fastq-dump -B -A ERR32754 -B | &#x2013;dump base Formats sequence using base space (default for other than SOLiD)</li>
<li>For colorspace SOLiD data, we can directly use &ldquo;rnaSeqSample_QuerySRA&rdquo; dataset class. CBIL/Util/lib/perl/Sra.pm will extract colorspace file to fastq data with ATCG. e.g. <a href="https://cbilsvn.pmacs.upenn.edu/svn/apidb/ApiCommonDatasets/trunk/Datasets/lib/xml/datasets/FungiDB/anidFGSCA4/Sibthorp_Growth_Conditions.xml">Sibthorp_Growth_Conditions</a></li>
</ol>
</div>
</li>

<li><a id="org0e5bd38"></a>BAM files from Provider<br>
<div class="outline-text-5" id="text-org0e5bd38">
<ol class="org-ol">
<li>convert BAM to FASTQ. Probably not the best but it is  doable. e.g. bam2fastq -o s1_48.sorted# s1_48.sorted.bam
<ul class="org-ul">
<li>/eupath/data/EuPathDB/manualDelivery/CryptoDB/cparIowaII/rnaSeq/Lippuner/2012-08-24/workSpace/README</li>
</ul></li>
<li>You can first sort the bam by read id - if there are read pairs, they will be sorted and paired up. However, this can be a problem if there are pairs where one has no read.
<ul class="org-ul">
<li>samtools sort -n map.Toxo1.sorted.bam &gt; sortedToxo1.bam &amp;</li>
</ul></li>
<li>An alternative bam to fastq script, a bedtools can be used:
<ul class="org-ul">
<li>bamToFastq -i sortedToxo1.bam -fq sortedToxo1.fastq  -fq2 sortedToxo1Pair.fastq) &gt;&amp; sortedToxo1.err &amp;</li>
</ul></li>
</ol>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1750285" class="outline-3">
<h3 id="org1750285">Dataset Configuration</h3>
<div class="outline-text-3" id="text-org1750285">
</div>
<div id="outline-container-org4b09224" class="outline-4">
<h4 id="org4b09224">Manual Delivery</h4>
<div class="outline-text-4" id="text-org4b09224">
</div>
<ul class="org-ul">
<li><a id="org3a1f776"></a>analysisConfig.txt file<br>
<div class="outline-text-5" id="text-org3a1f776">
<ul class="org-ul">
<li>when there are multiple profile set names for one dataset, each profileSet should have a prefix followed by a space, a dash and a space then something that distinguishes them.
<ul class="org-ul">
<li>Example: yew:/eupath/data/EuPathDB/manualDelivery/PlasmoDB/pberANKA/rnaSeq/Waters_Stunnenberg_five_stages/2014-03-14/final/analysisConfig.xml</li>
</ul></li>
<li>if there are replicates, the replicate sample names should be identical while of course the file names are not</li>
<li>commas are not tolerated in the sample names and will cause a problem on the website</li>
<li>If one experiment designed for multiple organisms, in the analysisConfig.xml file, for profileSetName, it can use the same value but separate it with a organism abbreviation.
<ul class="org-ul">
<li>Example(s): yew:/eupath/data/EuPathDB/manualDelivery/AmoebaDB/acasNeff/rnaSeq/Trophozoite_transcriptome/2017-12-29/final/analysisConfig.xml
yew:/eupath/data/EuPathDB/manualDelivery/AmoebaDB/ehisHM1IMSS/rnaSeq/Trophozoite_transcriptome/2017-11-21/final/analysisConfig.xml</li>
</ul></li>
<li>the names can have &ldquo;+&rdquo; or &ldquo;-&rdquo; but not slashes (&ldquo;/&rdquo;)
<ul class="org-ul">
<li>In terms of profileSetName: a note from Kathryn &ldquo;The problem is that when you have commas in profile set names they work ok on component sites, but it breaks the portal because commas are also used as delimiters there.  We had several problems where datasets were QA&rsquo;d in the components and signed off, but didn&rsquo;t work in the portal. To prevent this, we made the workflow throw and error when it finds a profileset name with a comma. You can safely change these in the analysisConfig - these are only used internally. A displayName, which can have commas, can be added in the presenter.&rdquo;</li>
</ul></li>
<li>If the sample names are changed in the analysisConfig.xml file after an initial run, in most cases all that is required is that the doTranscriptExpression needs to be undone in the workflow and rerun. However, if the samples have replicates, the step normalizeBedGraph also needs to be undone and rerun. This step will do nothing when undone but as it reruns, it will remove the original analyze_XXXXXXXXX_combined/  directories and then remake them with the correct names. This is true even if the replicate relationships are changed. If normalizeBedGraph is not undone, the old combined dirs will remain and the step copyNormalizedBedGraphFiles will fail because it will not find the dirs it needs.</li>
</ul>
</div>
</li>




<li><a id="org7758c8e"></a>fastq files (optional)<br>
<div class="outline-text-5" id="text-org7758c8e">
<ul class="org-ul">
<li>Place into manual delivery fastq files as described by the rnaSeqExperiment dataset class in <a href="https://github.com/VEuPathDB/EbrcModelCommon/blob/master/Model/lib/xml/datasetClass/classes.xml">classes.xml</a></li>
<li>NOTE:  file names with #1 and #2 are not a reliable indication of strandedness when isStrandSpecific=true and hasPairedEnds=true
<ul class="org-ul">
<li>sense = forward should not be the .paired file but antisense = reverse should be .paired</li>
</ul></li>
<li>not needed for RNASeq from EBI</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org371c2b4" class="outline-4">
<h4 id="org371c2b4">Dataset XML</h4>
<div class="outline-text-4" id="text-org371c2b4">
</div>
<ul class="org-ul">
<li><a id="org38bd86c"></a>NOTES<br>
<div class="outline-text-5" id="text-org38bd86c">
<ul class="org-ul">
<li>adaptor library maintenance
<ul class="org-ul">
<li>There is a data folder under DJob/DistribJobTask/data with the currently available Illumina adaptors for both PE and SE chemistry.
<ul class="org-ul">
<li>if the datasets are from experiments where sequencing chemistry other than TruSeq2 (as used in GAII machines) and TruSeq3 (as used by HiSeq and MiSeq machines) we would need to give a custom fasta file of adaptors or add to ours. <b>*</b></li>
</ul></li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd583a9e" class="outline-3">
<h3 id="orgd583a9e">Presenter Configuration</h3>
<div class="outline-text-3" id="text-orgd583a9e">
</div>
