SOPs/rnaseq.org
*** Injector 
| Property Name                | Specification                                                                                                                                                                                                                   |
|------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| isEuPathDBSite               | true/false; Set false for sites which are not included in eupathdb.org (like FungiDB)                                                                                                                                           |
| isAlignedToAnnotatedGenome   | true/false; If false, no gene queries will be enabled (only gbrowse tracks)                                                                                                                                                     |
| hasMultipleSamples           | true/false; If true, the standard fold change query will be injected.  Also will inject Fold Change by P Value query if "hasFishersExactTestData" is true.                                                                      |
| hasFishersExactTestData      | true/false; Set this to false to turn off the fold change w/ p value query.  Known BUG:  You must set to false for ALL Strand Specific experiments for the time being.                                                          |
| optionalQuestionDescription  | text; This text will be appended to EVERY injected question.  Most often, you should leave this empty.                                                                                                                          |
| showIntronJunctions          | true/false;  Should we add a gbrowse track for this experiment for intron spanning junctions?  Most often this is true, but check w/ biologist or data provider to ensure this is appropriate                                   |
| graphSampleLables            | semi colon delimited list of overrides for graph x axis labels.  Use this to add short names for graph labels.  Most often leave this blank as it will break if the loaded order changes                                        |
| graphBottomMarginSize        | integer; Set this if the bottom margin is too small and truncates the x axis labels.  Leave empty to start.  Increase as needed.                                                                                                |
| graphForceXLabelsHorizontal  | true/false;  You should start w/ this set to "false" and turn it on if desired.  X axis labels are easier to read when they are horizontal.  The graph default will draw them vertically over some preset number of characters. |
| graphXAxisSamplesDescription | text; This text will appear next to the graph on the gene record page and should describe the x axis labels from the graph.                                                                                                     |
| graphColor                   | Choose a color for the graph.  Color HEX is preferred                                                                                                                                                                           |
| graphPriorityOrderGrouping   | integer;  This controls the ordering of the graph on the gene record page.  it can be used to group similar graphs together.                                                                                                    |
| switchStrandsGBrowse         | boolean; Default is false. Set to true if the profileSet name with ‘firststrand’ is for ‘antisense’, and ‘secondstrand’ is for ‘sense’. This will take care of handling GBrowse big wig files correctly.                        |
| switchStrandsProfiles        | boolean; Default is false. Set to true if the profileSet name with ‘firststrand’ is for ‘antisense’, and ‘secondstrand’ is for ‘sense’. This will take care of handling profile graphs and data tables correctly.               |
| isDESeq                      | boolean; Default is false. Set to true for experiments with 2 or more conditions and more bio replicates each                                                                                                                   |
| isDEGseq                     | boolean; Default is false. leave ‘false’ unless we have a specific request from the user. This is because DEGSeq is not very statistically sound as it works with out replication.                                              |
| includeProfileSimilarity     | is set to "true" if you want to have the profileSimilarity Question with this dataset.                                                                                                                                          |
| profileTimeShift             | param only comes to play IF "includeProfileSimilarity" is set to "true".                                                                                                                                                        |

*** Special Considerations for the Dataset Presenter XML

- Any change made to elements in the presenter xml which are not properties of the "Injector" will require a tuning manager run.
- shortAttribution element of the presenter is required.  This is used in the RNA Seq internal search page.
- datasetShortDisplayName is required.  This is used in the for naming steps in strategies AND is used to name the columns in the results summary page
- hasPairedEnds and isStrandSpecific properties are taken from the Dataset xml (nothing is needed in the presenter xml for these)
- for intron junctions, there is some hard coding based on project in the java class which sets the intron size limit.  HostDB=50000;  All other sites are currently = 5000

** QA
*** Automated QA
