SOPs/rnaseq.html
<div id="outline-container-orgfbfafd2" class="outline-4">
<h4 id="orgfbfafd2">Injector</h4>
<div class="outline-text-4" id="text-orgfbfafd2">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Property Name</th>
<th scope="col" class="org-left">Specification</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">isEuPathDBSite</td>
<td class="org-left">true/false; Set false for sites which are not included in eupathdb.org (like FungiDB)</td>
</tr>

<tr>
<td class="org-left">isAlignedToAnnotatedGenome</td>
<td class="org-left">true/false; If false, no gene queries will be enabled (only gbrowse tracks)</td>
</tr>

<tr>
<td class="org-left">hasMultipleSamples</td>
<td class="org-left">true/false; If true, the standard fold change query will be injected.  Also will inject Fold Change by P Value query if &ldquo;hasFishersExactTestData&rdquo; is true.</td>
</tr>

<tr>
<td class="org-left">hasFishersExactTestData</td>
<td class="org-left">true/false; Set this to false to turn off the fold change w/ p value query.  Known BUG:  You must set to false for ALL Strand Specific experiments for the time being.</td>
</tr>

<tr>
<td class="org-left">optionalQuestionDescription</td>
<td class="org-left">text; This text will be appended to EVERY injected question.  Most often, you should leave this empty.</td>
</tr>

<tr>
<td class="org-left">showIntronJunctions</td>
<td class="org-left">true/false;  Should we add a gbrowse track for this experiment for intron spanning junctions?  Most often this is true, but check w/ biologist or data provider to ensure this is appropriate</td>
</tr>

<tr>
<td class="org-left">graphSampleLables</td>
<td class="org-left">semi colon delimited list of overrides for graph x axis labels.  Use this to add short names for graph labels.  Most often leave this blank as it will break if the loaded order changes</td>
</tr>

<tr>
<td class="org-left">graphBottomMarginSize</td>
<td class="org-left">integer; Set this if the bottom margin is too small and truncates the x axis labels.  Leave empty to start.  Increase as needed.</td>
</tr>

<tr>
<td class="org-left">graphForceXLabelsHorizontal</td>
<td class="org-left">true/false;  You should start w/ this set to &ldquo;false&rdquo; and turn it on if desired.  X axis labels are easier to read when they are horizontal.  The graph default will draw them vertically over some preset number of characters.</td>
</tr>

<tr>
<td class="org-left">graphXAxisSamplesDescription</td>
<td class="org-left">text; This text will appear next to the graph on the gene record page and should describe the x axis labels from the graph.</td>
</tr>

<tr>
<td class="org-left">graphColor</td>
<td class="org-left">Choose a color for the graph.  Color HEX is preferred</td>
</tr>

<tr>
<td class="org-left">graphPriorityOrderGrouping</td>
<td class="org-left">integer;  This controls the ordering of the graph on the gene record page.  it can be used to group similar graphs together.</td>
</tr>

<tr>
<td class="org-left">switchStrandsGBrowse</td>
<td class="org-left">boolean; Default is false. Set to true if the profileSet name with ‘firststrand’ is for ‘antisense’, and ‘secondstrand’ is for ‘sense’. This will take care of handling GBrowse big wig files correctly.</td>
</tr>

<tr>
<td class="org-left">switchStrandsProfiles</td>
<td class="org-left">boolean; Default is false. Set to true if the profileSet name with ‘firststrand’ is for ‘antisense’, and ‘secondstrand’ is for ‘sense’. This will take care of handling profile graphs and data tables correctly.</td>
</tr>

<tr>
<td class="org-left">isDESeq</td>
<td class="org-left">boolean; Default is false. Set to true for experiments with 2 or more conditions and more bio replicates each</td>
</tr>

<tr>
<td class="org-left">isDEGseq</td>
<td class="org-left">boolean; Default is false. leave ‘false’ unless we have a specific request from the user. This is because DEGSeq is not very statistically sound as it works with out replication.</td>
</tr>

<tr>
<td class="org-left">includeProfileSimilarity</td>
<td class="org-left">is set to &ldquo;true&rdquo; if you want to have the profileSimilarity Question with this dataset.</td>
</tr>

<tr>
<td class="org-left">profileTimeShift</td>
<td class="org-left">param only comes to play IF &ldquo;includeProfileSimilarity&rdquo; is set to &ldquo;true&rdquo;.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org778810b" class="outline-4">
<h4 id="org778810b">Special Considerations for the Dataset Presenter XML</h4>
<div class="outline-text-4" id="text-org778810b">
<ul class="org-ul">
<li>Any change made to elements in the presenter xml which are not properties of the &ldquo;Injector&rdquo; will require a tuning manager run.</li>
<li>shortAttribution element of the presenter is required.  This is used in the RNA Seq internal search page.</li>
<li>datasetShortDisplayName is required.  This is used in the for naming steps in strategies AND is used to name the columns in the results summary page</li>
<li>hasPairedEnds and isStrandSpecific properties are taken from the Dataset xml (nothing is needed in the presenter xml for these)</li>
<li>for intron junctions, there is some hard coding based on project in the java class which sets the intron size limit.  HostDB=50000;  All other sites are currently = 5000</li>
</ul>
</div>
</div>
</div>
