SOPs/rnaseq.org
*** Manual QA
1. [ ] Begin on the Data Sets record page accessible via the data summary tab.
   - [ ] Check all descriptive text including contact information and publications.
2. [ ] Click through links.
   - [ ] There should be a link to the Internal Search Page for RNA Seq.
   - [ ] There should be a link for a sample Gbrowse region
3. [ ] Click through enabled searches from Internal Search Page.  Ensure that the expected searches are showing up.
4. [ ] Run the searches and check that some genes are returned;
5. [ ] Check the column attribute names in the summary results page;  turn them all on to make sure they are working
6. [ ] Click on at least one gene to ensure the graph is showing up at the desired location in the page;
   - [ ] Check the x axis text; Check the x axis labels for truncated text
7. [ ]  From dataset record, click on "Example Graphs"; ensure the example graph looks ok
8. [ ] For strand specific RNA seq, additional QAs to strandedness on website.
   - [ ] QA Gbrowse track
   - [ ] Compare the glyph color of a gene and RNA seq scale coverage on gbrowse track. If the colors are opposite, change the "switchStrandsGBrowse" to true from false. (Should be able to confirm by looking at several genes.)
   - [ ] QA profile graph/data table
   - [ ] Use the following sql query to check the values in the results table. If the "secondstrand" values are much higher than "firststrand" for all protocol app nodes, change the "switchStrandsProfiles" to true from false. (can also confirm by looking at profiles and data tables on several gene pages.)
     #+begin_src sql
       select s.name, nfe.PROTOCOL_APP_NODE_ID, avg(nfe.value)
       from sres.externaldatabase d, SRES.EXTERNALDATABASERELEASE r, study.study s, study.studylink sl, results.nafeatureexpression nfe
       where d.name = 'XXXXX_rnaSeq_RSRC'
       and d.EXTERNAL_DATABASE_ID = r.external_database_id
       and s.EXTERNAL_DATABASE_RELEASE_ID = r.EXTERNAL_DATABASE_RELEASE_ID
       and s.STUDY_ID = sl.study_id
       and sl.PROTOCOL_APP_NODE_ID = nfe.PROTOCOL_APP_NODE_ID
       group by s.name, nfe.PROTOCOL_APP_NODE_ID
       order by s.name, nfe.PROTOCOL_APP_NODE_ID
     #+end_src
9. [ ] Check the red "new" icon shows up next to this experiment on the RNA Seq Evidence page (modify the file apiCommonModel.xml to change the buildNumber to the current one or update build number in dataset history in the presenter xml)


** Patches
*** Strand Specific Error
For stranded RNA seq, if both strands have equal coverage, need to run the following steps:
1. Delete “mappingStats.txt” files of every sample under master/mainresult dir:
   - For example:  rm /eupath/data/EuPathDB/workflows/FungiDB/29/data/cglaCBS138/gsnap/pHChange_NOStress/analyze_*/master/mainresult/mappingStats.txt
2. Delete “normalized” folders of every sample under master/mainresult dir:
   - For example:  rm -fr /eupath/data/EuPathDB/workflows/FungiDB/29/data/cglaCBS138/gsnap/pHChange_NOStress/analyze_*/master/mainresult/normalized
3. Manually run the “normalizeCoverage.pl ”:
   - For example, stranded, paired-end experiment: nohup normalizeCoverage.pl --inputDir /eupath/data/EuPathDB/workflows/FungiDB/29/data/cglaCBS138/gsnap/pHChange_NOStress --topLevelSeqSizeFile /eupath/data/EuPathDB/workflows/FungiDB/29/data/cglaCBS138/gsnap/topLevelSeqSizes.txt --strandSpecific --isPairedEnd > cglaCBS138_pHChange_NOStress.log 2> cglaCBS138_pHChange_NOStress.log&
4. Run workflow to undo and reload one step:
   - Undo cglaCBS138_gsnap_topLevel.pHChange_NOStress_analyze_rnaSeq_experiment.copyNormalizedBedGraphToWebServiceDir  step in workflow
