SOPs/rnaseq.html

<div id="outline-container-orgac2be03" class="outline-3">
<h3 id="orgac2be03">QA</h3>
<div class="outline-text-3" id="text-orgac2be03">
</div>
<div id="outline-container-orgacc2e4f" class="outline-4">
<h4 id="orgacc2e4f">Automated QA</h4>
</div>
<div id="outline-container-orgd43b87b" class="outline-4">
<h4 id="orgd43b87b">Manual QA</h4>
<div class="outline-text-4" id="text-orgd43b87b">
<ol class="org-ol">
<li class="off"><input type='checkbox' /> Begin on the Data Sets record page accessible via the data summary tab.
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Check all descriptive text including contact information and publications.</li>
</ul></li>
<li class="off"><input type='checkbox' /> Click through links.
<ul class="org-ul">
<li class="off"><input type='checkbox' /> There should be a link to the Internal Search Page for RNA Seq.</li>
<li class="off"><input type='checkbox' /> There should be a link for a sample Gbrowse region</li>
</ul></li>
<li class="off"><input type='checkbox' /> Click through enabled searches from Internal Search Page.  Ensure that the expected searches are showing up.</li>
<li class="off"><input type='checkbox' /> Run the searches and check that some genes are returned;</li>
<li class="off"><input type='checkbox' /> Check the column attribute names in the summary results page;  turn them all on to make sure they are working</li>
<li class="off"><input type='checkbox' /> Click on at least one gene to ensure the graph is showing up at the desired location in the page;
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Check the x axis text; Check the x axis labels for truncated text</li>
</ul></li>
<li class="off"><input type='checkbox' /> From dataset record, click on &ldquo;Example Graphs&rdquo;; ensure the example graph looks ok</li>
<li class="off"><input type='checkbox' /> For strand specific RNA seq, additional QAs to strandedness on website.
<ul class="org-ul">
<li class="off"><input type='checkbox' /> QA Gbrowse track</li>
<li class="off"><input type='checkbox' /> Compare the glyph color of a gene and RNA seq scale coverage on gbrowse track. If the colors are opposite, change the &ldquo;switchStrandsGBrowse&rdquo; to true from false. (Should be able to confirm by looking at several genes.)</li>
<li class="off"><input type='checkbox' /> QA profile graph/data table</li>
<li class="off"><input type='checkbox' /> <p>
Use the following sql query to check the values in the results table. If the &ldquo;secondstrand&rdquo; values are much higher than &ldquo;firststrand&rdquo; for all protocol app nodes, change the &ldquo;switchStrandsProfiles&rdquo; to true from false. (can also confirm by looking at profiles and data tables on several gene pages.)
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> s.<span class="org-keyword">name</span>, nfe.PROTOCOL_APP_NODE_ID, <span class="org-builtin">avg</span>(nfe.<span class="org-keyword">value</span>)
<span class="org-keyword">from</span> sres.externaldatabase d, SRES.EXTERNALDATABASERELEASE r, study.study s, study.studylink sl, results.nafeatureexpression nfe
<span class="org-keyword">where</span> d.<span class="org-keyword">name</span> = <span class="org-string">'XXXXX_rnaSeq_RSRC'</span>
<span class="org-keyword">and</span> d.EXTERNAL_DATABASE_ID = r.external_database_id
<span class="org-keyword">and</span> s.EXTERNAL_DATABASE_RELEASE_ID = r.EXTERNAL_DATABASE_RELEASE_ID
<span class="org-keyword">and</span> s.STUDY_ID = sl.study_id
<span class="org-keyword">and</span> sl.PROTOCOL_APP_NODE_ID = nfe.PROTOCOL_APP_NODE_ID
<span class="org-keyword">group</span> <span class="org-keyword">by</span> s.<span class="org-keyword">name</span>, nfe.PROTOCOL_APP_NODE_ID
<span class="org-keyword">order</span> <span class="org-keyword">by</span> s.<span class="org-keyword">name</span>, nfe.PROTOCOL_APP_NODE_ID
</pre>
</div></li>
</ul></li>
<li class="off"><input type='checkbox' /> Check the red &ldquo;new&rdquo; icon shows up next to this experiment on the RNA Seq Evidence page (modify the file apiCommonModel.xml to change the buildNumber to the current one or update build number in dataset history in the presenter xml)</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orgaee9f84" class="outline-3">
<h3 id="orgaee9f84">Patches</h3>
<div class="outline-text-3" id="text-orgaee9f84">
</div>
<div id="outline-container-orgd925e41" class="outline-4">
<h4 id="orgd925e41">Strand Specific Error</h4>
<div class="outline-text-4" id="text-orgd925e41">
<p>
For stranded RNA seq, if both strands have equal coverage, need to run the following steps:
</p>
<ol class="org-ol">
<li>Delete “mappingStats.txt” files of every sample under master/mainresult dir:
<ul class="org-ul">
<li>For example:  rm /eupath/data/EuPathDB/workflows/FungiDB/29/data/cglaCBS138/gsnap/pHChange_NOStress/analyze_*/master/mainresult/mappingStats.txt</li>
</ul></li>
<li>Delete “normalized” folders of every sample under master/mainresult dir:
<ul class="org-ul">
<li>For example:  rm -fr /eupath/data/EuPathDB/workflows/FungiDB/29/data/cglaCBS138/gsnap/pHChange_NOStress/analyze_*/master/mainresult/normalized</li>
</ul></li>
<li>Manually run the “normalizeCoverage.pl ”:
<ul class="org-ul">
<li>For example, stranded, paired-end experiment: nohup normalizeCoverage.pl &#x2013;inputDir /eupath/data/EuPathDB/workflows/FungiDB/29/data/cglaCBS138/gsnap/pHChange_NOStress &#x2013;topLevelSeqSizeFile /eupath/data/EuPathDB/workflows/FungiDB/29/data/cglaCBS138/gsnap/topLevelSeqSizes.txt &#x2013;strandSpecific &#x2013;isPairedEnd &gt; cglaCBS138_pHChange_NOStress.log 2&gt; cglaCBS138_pHChange_NOStress.log&amp;</li>
</ul></li>
<li>Run workflow to undo and reload one step:
<ul class="org-ul">
<li>Undo cglaCBS138_gsnap_topLevel.pHChange_NOStress_analyze_rnaSeq_experiment.copyNormalizedBedGraphToWebServiceDir  step in workflow</li>
</ul></li>
</ol>
</div>
</div>
</div>
</section>
</main>
</body>
</html>
